export interface ITypingList {
  Network: string[];
  DataStructure: string[];
  Database: string[];
  DesignPattern: string[];
  OperatingSystem: string[];
  Bookmark?: string[];
}

export const typingList: ITypingList = {
  Network: [
    'HTTP는 HTML 문서와 같은 리소스들을 가져올 수 있도록 해주는 프로토콜이다.',
    'HTTP는 웹에서 이루어지는 모든 데이터 교환의 기초이며, 클라이언트-서버 프로토콜이다.',
    '보통 클라이언트에 의해 전송되는 메시지를 요청이라고 부르며, 그에 대해 서버에서 전송되는 메시지를 응답이라고 부른다.',
  ],
  DataStructure: [
    'HTTP는 HTML 문서와 같은 리소스들을 가져올 수 있도록 해주는 프로토콜이다.',
    'HTTP는 웹에서 이루어지는 모든 데이터 교환의 기초이며, 클라이언트-서버 프로토콜이다.',
    '보통 클라이언트에 의해 전송되는 메시지를 요청이라고 부르며, 그에 대해 서버에서 전송되는 메시지를 응답이라고 부른다.',
  ],
  Database: [
    'HTTP는 HTML 문서와 같은 리소스들을 가져올 수 있도록 해주는 프로토콜이다.',
    'HTTP는 웹에서 이루어지는 모든 데이터 교환의 기초이며, 클라이언트-서버 프로토콜이다.',
    '보통 클라이언트에 의해 전송되는 메시지를 요청이라고 부르며, 그에 대해 서버에서 전송되는 메시지를 응답이라고 부른다.',
  ],
  DesignPattern: [
    'HTTP는 HTML 문서와 같은 리소스들을 가져올 수 있도록 해주는 프로토콜이다.',
    'HTTP는 웹에서 이루어지는 모든 데이터 교환의 기초이며, 클라이언트-서버 프로토콜이다.',
    '보통 클라이언트에 의해 전송되는 메시지를 요청이라고 부르며, 그에 대해 서버에서 전송되는 메시지를 응답이라고 부른다.',
  ],
  OperatingSystem: [
    'HTTP는 HTML 문서와 같은 리소스들을 가져올 수 있도록 해주는 프로토콜이다.',
    'HTTP는 웹에서 이루어지는 모든 데이터 교환의 기초이며, 클라이언트-서버 프로토콜이다.',
    '보통 클라이언트에 의해 전송되는 메시지를 요청이라고 부르며, 그에 대해 서버에서 전송되는 메시지를 응답이라고 부른다.',
  ],
};
